In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('spam.csv',encoding="ISO-8859-1")

In [5]:
df.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [6]:
df.shape

(5572, 5)

In [7]:
#Data Cleaning
#EDA
#TExt Pre-processing
#Model Building
#Evaluation

Data Cleaning

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [10]:
# drop Last 3 cols
df.drop(columns=['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4'], inplace=True)

In [11]:
df.head()

     v1                                                 v2
0   ham  Go until jurong point, crazy.. Available only ...
1   ham                      Ok lar... Joking wif u oni...
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...
3   ham  U dun say so early hor... U c already then say...
4   ham  Nah I don't think he goes to usf, he lives aro...

In [12]:
# renaming the cols
df.rename (columns={'v1':'target', 'v2':'text'},inplace=True)
df.sample(5)

     target                                               text
5074   spam  This is the 2nd attempt to contract U, you hav...
223     ham  U say leh... Of course nothing happen lar. Not...
2307   spam  WIN a year supply of CDs 4 a store of ur choic...
754     ham  Realy sorry-i don't recognise this number and ...
3620    ham  That means from february to april i'll be gett...

In [16]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [18]:
df['target'] = encoder.fit_transform(df['target'])

In [20]:
df.sample(5)

      target                                               text
651        0  I'm gonna say no. Sorry. I would but as normal...
1213       0  Yeah, probably but not sure. Ilol let u know, ...
554        0  IÛ÷ll have a look at the frying pan in case i...
3248       0                   Sorry, I can't help you on this.
979        0  Another month. I need chocolate weed and alcohol.